tests/dropletRelaxation2D/src/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    empty1
    {
        type            empty;
    }
    empty2
    {
        type            empty;
    }
    open
    {
//         type            fixedValue;
//         value           $internalField;
//         type            totalPressure;
//         p0              uniform 0;
        type            fixedFluxPressure;
        value           uniform 0;
    }
}


// ************************************************************************* //
